[
  {
    "title": "Основы HTML и CSS",
    "slug": "html-css-basics",
    "excerpt": "Познакомьтесь с основами HTML и CSS — основными технологиями для создания веб-страниц.",
    "content": "HTML (HyperText Markup Language) отвечает за структуру веб-страницы, а CSS (Cascading Style Sheets) управляет её стилем и визуальным оформлением..."
  },
  {
    "title": "Введение в JavaScript",
    "slug": "intro-to-js",
    "excerpt": "Что такое JavaScript и как он используется для создания динамических веб-приложений?",
    "content": "JavaScript — это язык программирования, который позволяет добавлять интерактивность на веб-страницы. Он используется для обработки событий, работы с DOM, отправки запросов на сервер и многого другого..."
  },
  {
    "title": "Как работает DOM и манипуляция им в JavaScript",
    "slug": "dom-manipulation-js",
    "excerpt": "Разбираем Document Object Model (DOM) и методы его изменения в JavaScript.",
    "content": "DOM представляет собой структуру HTML-документа в виде дерева объектов, которое можно изменять с помощью JavaScript..."
  },
  {
    "title": "Современный CSS: Flexbox и Grid",
    "slug": "modern-css-flexbox-grid",
    "excerpt": "Flexbox и Grid Layout — мощные инструменты для создания адаптивных макетов.",
    "content": "Flexbox позволяет удобно выстраивать элементы в одном направлении (горизонтально или вертикально), а Grid даёт контроль над двухмерным расположением элементов на странице..."
  },
  {
    "title": "Основы работы с API в веб-разработке",
    "slug": "web-api-basics",
    "excerpt": "Как взаимодействовать с внешними сервисами с помощью API?",
    "content": "API (Application Programming Interface) позволяет веб-приложениям получать данные и отправлять их на сервер, используя такие технологии, как Fetch API и Axios..."
  },
  {
    "title": "React.js: введение в современную фронтенд-разработку",
    "slug": "react-introduction",
    "excerpt": "Что такое React.js и почему он стал стандартом в веб-разработке?",
    "content": "React — это библиотека JavaScript для создания пользовательских интерфейсов. Она использует компонентный подход и Virtual DOM для оптимизации рендеринга..."
  },
  {
    "title": "Node.js и основы серверной разработки",
    "slug": "nodejs-server-basics",
    "excerpt": "Изучаем основы Node.js — платформы для выполнения JavaScript на сервере.",
    "content": "Node.js позволяет использовать JavaScript для серверной разработки, что делает возможным создание полноценных веб-приложений на одном языке..."
  },
  {
    "title": "MongoDB: основная NoSQL база данных для веб-приложений",
    "slug": "mongodb-nosql-intro",
    "excerpt": "Как работает MongoDB и чем она отличается от реляционных баз данных?",
    "content": "MongoDB — это NoSQL база данных, в которой данные хранятся в формате JSON-подобных документов. Это делает её гибкой и удобной для работы с веб-приложениями..."
  },
  {
    "title": "REST vs GraphQL: что выбрать для веб-приложения?",
    "slug": "rest-vs-graphql",
    "excerpt": "Сравниваем два популярных подхода к созданию API: REST и GraphQL.",
    "content": "REST использует стандартизированные HTTP-запросы, а GraphQL даёт клиенту больше контроля над запрашиваемыми данными. Оба подхода имеют свои преимущества и недостатки..."
  },
  {
    "title": "Тестирование веб-приложений: Jest и Cypress",
    "slug": "web-testing-jest-cypress",
    "excerpt": "Как тестировать фронтенд и бэкенд веб-приложений?",
    "content": "Jest — это популярный инструмент для тестирования JavaScript-кода, а Cypress — мощный инструмент для тестирования пользовательских интерфейсов..."
  },
  {
    "title": "Docker для веб-разработчиков: как запустить проект в контейнере?",
    "slug": "docker-for-web-devs",
    "excerpt": "Как контейнеризация с Docker упрощает развертывание и разработку веб-приложений?",
    "content": "Docker позволяет запускать веб-приложения в изолированных контейнерах, что делает их переносимыми и удобными в развертывании..."
  },
  {
    "title": "Next.js: лучший фреймворк для React-разработки?",
    "slug": "nextjs-framework",
    "excerpt": "Как Next.js улучшает работу с React и делает веб-приложения быстрее?",
    "content": "Next.js предоставляет серверный рендеринг (SSR) и статическую генерацию (SSG), что улучшает производительность веб-приложений..."
  },
  {
    "title": "DevOps и CI/CD в веб-разработке",
    "slug": "devops-cicd-web",
    "excerpt": "Как автоматизировать процесс развертывания и тестирования веб-приложений?",
    "content": "CI/CD (Continuous Integration/Continuous Deployment) помогает разработчикам автоматизировать тестирование и развертывание кода, снижая вероятность ошибок..."
  }
]
